Revit 2024 API
BuiltInFailures.SketchFailures.RebarManyLoops Property
 Rebar Sketch contains more than one loop. Can't create Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarManyLoops { get; }
Visual Basic
Public Shared ReadOnly Property RebarManyLoops As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarManyLoops {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace